
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 1 to change, 4 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST-V14
* Replace
  * module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;plum&#34;]
  * module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;rhubarb&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST-V14 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-V14" {
        id                      = "https://plumsi-aat.vault.azure.net/secrets/recipe-backend-POSTGRES-HOST-V14/e92bc56c55dd4f88a988592d45e90375"
        name                    = "recipe-backend-POSTGRES-HOST-V14"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ create_mode                   = "Update" -> "Default" # forces replacement
      ~ fqdn                          = "plum-v14-flexible-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/plum-v14-flexible-aat" -> (known after apply)
        name                          = "plum-v14-flexible-aat"
      ~ public_network_access_enabled = false -> (known after apply)
      ~ storage_tier                  = "P6" -> (known after apply)
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/cnp-plum-recipes-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "CNP"
        }
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/plum-v14-flexible-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/plum-v14-flexible-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["plum"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/plum-v14-flexible-aat/databases/plum" -> (known after apply)
        name      = "plum"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/plum-v14-flexible-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql_flexible.azurerm_postgresql_flexible_server_database.pg_databases["rhubarb"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/plum-v14-flexible-aat/databases/rhubarb" -> (known after apply)
        name      = "rhubarb"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/plum-v14-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/plum-v14-flexible-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":953,"Program":"tfcmt","SHA1":"","Vars":{}} -->